src/Embedded System/Embedded Linux Command Sheet.org
#+SETUPFILE: ~/.emacs.d/src/org-templates/level-1.org
#+TITLE: Embedded Linux Command Sheet
#+OPTIONS: num:nil H:2


* Setting Date and Time[fn:1]
** Setting the date/time using "date"
#+begin_src sh
date -s MMDDhhmm
date -s MMDDhhmmYY
date -s MMDDhhmmYY.ss
#+end_src

** Setting your local timezone
#+begin_src sh
# ls -l /etc/localtime
lrwxrwxrwx 1 root root 27 Jul 10 23:05 /etc/localtime -> /usr/share/zoneinfo/PST8PDT
# ln -s /usr/share/zoneinfo/CST6CDT /etc/localtime

You may want to try this if the above returns something like "file exists".
# ln -sf /usr/share/zoneinfo/CST6CDT /etc/localtime
#+end_src

#+begin_src sh
# opkg install tzdata
# ln -sf /usr/share/zoneinfo/America/Los_Angeles /etc/localtime
#+end_src


** Setting the date/time automatically with NTP
#+beign_src sh
opkg install ntpclient
ntpclient -s -h pool.ntp.org
ntpclient -s -h cn.pool.ntp.org
ntpclient -s -h hk.pool.ntp.org
#+end_src

#+begin_src sh
# opkg install ntpdate
# /usr/bin/ntpdate -b -s -u pool.ntp.org
#+end_src


** Syncing the hardware clock
#+begin_src sh
hwclock --systohc
#+end_src




* Footnotes

[fn:1] http://wiki.openmoko.org/wiki/Setting_Date_and_Time

