src/Embedded System/Embedded Linux Command Sheet.tex
% Created 2012-11-19 Mon 10:17
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\providecommand{\alert}[1]{\textbf{#1}}

\title{Embedded Linux Command Sheet}
\author{Shi Shougang}
\date{\today}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs Org-mode version 7.8.09}}

\begin{document}

\maketitle



\section*{Setting Date and Time\footnote{http://wiki.openmoko.org/wiki/Setting$_{\mathrm{Date}}$$_{\mathrm{and}}$$_{\mathrm{Time}}$}
\label{sec-1}

 } 
\subsection*{Setting the date/time using ``date''}
\label{sec-1-1}


\begin{verbatim}
date -s MMDDhhmm
date -s MMDDhhmmYY
date -s MMDDhhmmYY.ss
\end{verbatim}
\subsection*{Setting your local timezone}
\label{sec-1-2}


\begin{verbatim}
# ls -l /etc/localtime
lrwxrwxrwx 1 root root 27 Jul 10 23:05 /etc/localtime -> /usr/share/zoneinfo/PST8PDT
# ln -s /usr/share/zoneinfo/CST6CDT /etc/localtime

You may want to try this if the above returns something like "file exists".
# ln -sf /usr/share/zoneinfo/CST6CDT /etc/localtime
\end{verbatim}


\begin{verbatim}
# opkg install tzdata
# ln -sf /usr/share/zoneinfo/America/Los_Angeles /etc/localtime
\end{verbatim}
\subsection*{Setting the date/time automatically with NTP}
\label{sec-1-3}

opkg install ntpclient
ntpclient -s -h pool.ntp.org
ntpclient -s -h cn.pool.ntp.org
ntpclient -s -h hk.pool.ntp.org


\begin{verbatim}
# opkg install ntpdate
# /usr/bin/ntpdate -b -s -u pool.ntp.org
\end{verbatim}
\subsection*{Syncing the hardware clock}
\label{sec-1-4}


\begin{verbatim}
hwclock --systohc
\end{verbatim}

\end{document}
